Revit 2024 API
Units Class
 A document's default settings for formatting numbers with units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class Units : IDisposable
Visual Basic
Public Class Units _
	Implements IDisposable
Visual C++
public ref class Units : IDisposable
Remarks
The Units class represents a document's default settings for formatting numbers with units as strings. It contains a FormatOptions object for each unit type as well as settings related to decimal symbol and digit grouping.
The Units class stores a FormatOptions object for every valid unit type, but not all of them can be directly modified. Some, like UT_Number and UT_SiteAngle, have fixed definitions. Others have definitions which are automatically derived from other unit types. For example, UT_SheetLength is derived from UT_Length and UT_ForceScale is derived from UT_Force. See IsModifiableUnitType() and GetModifiableUnitTypes().
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Units
See Also
Units Members
Autodesk.Revit.DB Namespace